[
  {
    "Committee": "Chapter Technology Transfer Committee (CTT)",
    "name": "Mr. Mohammad Tassi",
    "title": "CTT Regional Vice Chair",
    "email": "mohd.tassi@gmail.com",
    "bio": "This committee provides efficient and effective transfer of current and relevant information throughout the HVAC&R industry to and from the Chapters. CTTC develops and maintains high quality and readily available tools to enable Chapters to offer information and attractive industry-related information and programs to all segments within the HVAC&R industry. CTTC reports to the Members Council."
  },
  {
    "Committee": "Government Affairs Committee (GA)",
    "name": "Mr. Maged Foaud Hashem",
    "title": "GA Regional Vice Chair",
    "email": "maged@mag-center.com",
    "bio": "This committee is responsible for organizing ASHRAE members to educate local, state, provincial, and national government bodies and officials in areas of interest to ASHRAE members, and to promote effective cooperation between ASHRAE members and government. The committee works to coordinate government affairs efforts and is responsible for developing the extent and the manner in which ASHRAE implements and pursues actions to influence government affairs and public policy."
  },
  {
    "Committee": "Membership Promotion Committee (MP)",
    "name": "Mr. Mohamed Ibrahim",
    "title": "MP Regional Vice Chair",
    "email": "aqraa@hotmail.com",
    "bio": "This committee publicizes the aims, activities, achievements, and scientific and educational purposes of the Society to encourage qualified persons to apply for membership. The committee also monitors the Society's membership demographics and, where appropriate,adjusts,or creates programs to ensure that individuals from all demographic backgrounds are being equally attracted to ASHRAE. This committee reports to Members Council."
  },
  {
    "Committee": "Research Promotion Committee (RP)",
    "name": "Mr. Aakash Patel",
    "title": "RP Regional Vice Chair",
    "email": "aakash@volpaksystems.co.in",
    "bio": "This committee plans and implements programs within the Society to generate funds to support ASHRAE research, YEA, Education (ALI), ASHRAE Foundation, Scholarships, and the General Fund. This committee reports to Members Council."
  },
  {
    "Committee": "Student Activities Committee (SA)",
    "name": "Mr. Michel Hayek",
    "title": "SA Regional Vice Chair",
    "email": "mhayek@ndu.edu.lb",
    "bio": "This committee develops a comprehensive program for the educational community for the purpose of promoting and encouraging engineering and HVAC&R careers. It administers and promotes student activities at all levels in the educational system. This committee reports to Members Council."
  },
  {
    "Committee": "Young Engineers in ASHRAE (YEA)Committee",
    "name": "Mr. Muhammad Omer Khan",
    "title": "YEA Regional Vice Chair",
    "email": "m.umer.khan.329@gmail.com",
    "bio": "This committee enhances member benefits for young professional ASHRAE members, 35 years old and younger, by identifying activities and services focused on their needs."
  },
  {
    "Committee": "Nominating Committee",
    "name": "Mr. Bassel Anbari",
    "title": "Nominating Committee Chair",
    "email": "bassel@intercool.ae",
    "bio": "This committee selects candidates for elected officers and members of the Board of Directors. This committee reports directly to the ASHRAE membership."
  }
]