[
  {
    "name": "MR. OMAR ABDELAZIZ",
    "title": "Ph.D., Member ASHRAE",
    "bio": "Omar Abdelaziz, Ph.D., Member ASHRAE, has 15 years of R&D and project management experience in building energy-efficient technologies, sustainable energy production and utilization, energy storage, technology evaluation and prioritization, thermodynamic analysis, thermofluid engineering, computational fluid dynamics, engineering optimization, alternative cooling and heating technologies, and alternative lower global warming refrigerants. He actively collaborates with leading appliance and equipment manufacturers on the development of advanced and state-of-the-art HVAC&R equipment. He has strong academic and research connections and is quite involved in ASHRAE.",
    "Course Taught": "NEW! The Future of Refrigerants: Challenges and Opportunities (MENA)"
  },
  {
    "name": "MR. KARIM AMARANE",
    "title": "Ph.D., Member ASHRAE",
    "bio": "Dr. Karim Amrane is owner and president of KA Consulting Services, LLC, where he provides strategic consulting services to HVAC&R businesses regarding federal and state regulations, legislation, codes and standards, alternative refrigerants, and energy efficiency. He is also an adjunct professor at the University of Maryland. where he teaches graduate courses in mechanical engineering. Prior to establishing his consulting firm, Dr. Amrane was Senior Vice President at the Air-Conditioning, Heating, and Refrigeration Institute (AHRI). In this capacity, he managed the industry's cooperative research program and was responsible for the development and implementation of AHRI's regulatory and international policy. Dr. Amrane has over 25 years of experience in the air-conditioning and refrigeration industry. He is a member of ASHRAE, the International Institute of Refrigeration (IIR), and the American Society of Mechanical Engineers (ASME). Dr. Amrane is the recipient of ASHRAE's Distinguished Service Award.",
    "Course Taught": "The Future of Refrigerants: Challenges and Opportunities (MENA)"
  },
  {
    "name": "MR. WALID CHAKROUN",
    "title": "Ph.D., P.E., Fellow ASHRAE",
    "bio": "Walid Chakroun, Ph.D., P.E., Fellow ASHRAE, is a professor in the Mechanical Engineering Department at Kuwait University. His interests include experimental and numerical thermal and fluid sciences in general and in air-conditioning systems and indoor air quality in particular. Dr. Chakroun served previously as Director for the Region At Large for ASHRAE, and he is currently serving as Vice President for the ASHRAE Publishing and Education Council and a liaison coordinator between ASHRAE and UNEP. Dr. Chakroun has authored and co-authored more than 75 journal articles and conference papers. He also co-authored a book, An Experimental Course in Thermal Engineering. He is the recipient of the prestigious ASHRAE John F. James Award and Distinguished Service awards.",
    "Course Taught": ""
  },
  {
    "name": "MR. HESHAM SAFWAT",
    "title": "Ph.D., Member ASHRAE",
    "bio": "Hesham Safwat, Ph.D., Member ASHRAE, has years of experience in the industry and in applied engineering science. His expertise includes sustainability practices and green buildings, especially with geothermal ground-source heat pumps and energy and atmosphere concerns for LEED for Middle Eastern commercial projects. Previous to joining the British University in Egypt in 2014 as lecturer in the Department of Mechanical Engineering, Dr. Hesham served as both instructor and a technical manager for Miraco Carrier where he was responsible for chillers, air handing units, fan coil selection, and pricing. Dr. Hesham has extensive knowledge in HVAC design and energy modeling, HAP LEED courses, and high-performance building, ASHRAE Standard 62.1, and ASHRAE Standard 90.1.",
    "Course Taught": ""
  },
  {
    "name": "MR. SAMIR TRABOULSI",
    "title": "Ph.D., P.Eng., Fellow Life Member ASHRAE",
    "bio": "Samir Traboulsi, Ph.D., P.Eng., Fellow Life Member ASHRAE, is currently a senior lecturer at the American University of Beirut and has taught a variety of subjects including building services technical courses, MEP design of green buildings, HVAC design courses, thermodynamics, operations research, the engineering economy, and engineering ethics. Dr. Traboulsi is the founder and was the president of the Lebanese chapter of ASHRAE, as well as director regional chair and director at large for ASHRAE. He also served as co-founder and former president of the Lebanon Green Building Council. He has worked extensively with UN agencies as a consultant and has presented lectures worldwide. Dr. Traboulsi is the author of numerous publications and is the recipient of both the ASHRAE Distinguished Service Award and the ASHRAE Exceptional Service Award.",
    "Course Taught": "HVAC Design Essentials (MENA)"
  },
  {
    "name": "MR. HASSAN YOUNES",
    "title": "Member ASHRAE, BEAP, BEMP, HBDP, CPMP, HFDP, OPMP",
    "bio": "Hassan Younes, Member ASHRAE, is a technical director and partner at Griffin Consultants. He has extensive experience in the fields of design, sustainability, commissioning, project execution and management, energy efficiency, and value engineering. He holds all ASHRAE certifications and is a certified energy manager, a certified measurement and verification professional, and a LEED-accredited professional. Hassan is a Grassroots Government Advocacy Committee (GGAC) member in the ASHRAE Region-at-Large, as well as a GGAC chair in the UAE local chapter.He was awarded the Middle East Energy Professional of the Year award in 2015 by AEE, Middle East Young Engineer of the Year 2010, and was part of the Griffin Consultant's team awarded the Energy Consultant of the Year 2017 award by Retrofit Tech and the Middle East Boutique Consultancy of the Year 2014 award.",
    "Course Taught": "HVAC Design Essentials (MENA)"
  }
]