[
  {
    "name": "Dr Ahmed Alaa Eldin Mohamed",
    "title": "Director & Regional Chair",
    "email": "ahmed.alaa@ashraeuae.org",
    "bio": "Graduated in 1991 with a Master in Mechanical Power Engineering from Alexandria University. PHD Management Preston University U.S.A. (Ajman Campus), 2010."
  },
  {
    "name": "Mr. Farooq Mehboob",
    "title": "Assistant Regional Chair",
    "email": "farooq.mehboob@smehboob.com",
    "bio": "Bachelors in Mechanical Engineering, 1965 from East Pakistan University of Engineering and Technology."
  },
  {
    "name": "Mr. Richie Mittal",
    "title": "Regional Members Council Representative",
    "email": "richiemittal@gmail.com",
    "bio": "Bachelors in Mechanical Engineering from Birla Institute of Technology, Mesra, Ranchi, & Masters in Thermal Engineering from Delhi College of Engineering."
  },
  {
    "name": "Ms. Adeeba Mehboob",
    "title": "Sub Region I Chair",
    "email": "adeeba.mehboob@smehboob.com",
    "bio": "Graduated in Mechanical Engineering from University College London."
  },
  {
    "name": "Mr. Nitin Naik",
    "title": "Sub Region II Chair",
    "email": "nitin@dewpoint.in",
    "bio": "Graduate Engineer with 26 years work experience."
  },
  {
    "name": "Mr. Mohammad Tassi",
    "title": "RVC CTTC",
    "email": "mohd.tassi@gmail.com",
    "bio": "Is a holder of Master's degree in Engineering Management, and Bachelor's degree in Mechanical Engineering. He has also completed many international formal professional training/ education programs in his field."
  },
  {
    "name": "Mr. Maged Foaud Hashem",
    "title": "RVC GAC",
    "email": "maged@mag-center.com",
    "bio": "Graduated in 1983 from the faculty of Engineering in Alexandria University, Power Engineering, and has been a professional HVAC engineer since then."
  },
  {
    "name": "Mr. Mohamed Ibrahim",
    "title": "RVC MP",
    "email": "aqraa@hotmail.com",
    "bio": "Mohamed Ibrahim is Control and instrumentation Director in Dc pro engineering Has 20 years experience in the control & Automation Most in District cooling plant in Addition to various industry such as water & Waste water, cement, paper plant , Food & beverage , For last ten years been as designer & system analysts for HVAC & district cooling process."
  },
  {
    "name": "Mr. Aakash Patel",
    "title": "RVC RP",
    "email": "aakash@volpaksystems.co.in",
    "bio": "Aakash Patel is an Engineer graduated from University of Mumbai in 2004. He completed his Post Graduation in Business Management from T A Pai Management Institute, Manipal in 2008."
  },
  {
    "name": "Mr. Michel Hayek",
    "title": "RVC SA",
    "email": "mhayek@ndu.edu.lb",
    "bio": "Michel Hayek is currently a professor in the Department of Mechanical Engineering and is serving as the Dean of the Faculty of Engineering at Notre Dame University-Louaize, Lebanon, since October 2012."
  },
  {
    "name": "Mr. Muhammad Omer Khan",
    "title": "RVC YEA",
    "email": "m.umer.khan.329@gmail.com",
    "bio": "Muhammad Omer Khan is a Mechanical Engineer from the NED University of Engineering and Technology, Karachi, graduating in 2012. He is currently working as a Planning Manager at Shan Associates and works in the design and implementation of HVAC systems."
  },
  {
    "name": "Mr. Bassel Anbari",
    "title": "Nominating Committee",
    "email": "bassel@intercool.ae",
    "bio": "Graduated from Tennessee Technological University USA in 1984 with Bachelor of Science in Mechanical Engineering."
  },
  {
    "name": "Mr. Arvind Surange",
    "title": "Refrigeration Chair",
    "email": "acr.consultants@gmail.com",
    "bio": "Has Master's Degree In AC&Ref from University Of Roorkee (Now IIT) In 1963 & Advanced Training In Germany & Denmark."
  },
  {
    "name": "Dr. Atilla Biyikoglu",
    "title": "Historian",
    "email": "abiyik@gazi.edu.tr",
    "bio": "He has received license degree in 1989 from Mechanical Engineering Department at Gazi University, MSc. degree in 1992 from Mechanical Engineering Department at M.E.T.U., and PhD degree in 1998 from Mechanical Engineering Department of Gazi University."
  },
  {
    "name": "Mr. Sayani Sri Haribabu",
    "title": "Regional Treasurer",
    "email": "sayanihari@yahoo.com",
    "bio": "Has completed Post Graduate Diploma in Refrigeration and Air Conditioning and MBA from University of Honolulu, USA."
  },
  {
    "name": "Mr. Osama Khayata",
    "title": "Webmaster and ECC Chair",
    "email": "osama@ashraeral.org",
    "bio": "Graduated in Mechanical Engineering from University of Aleppo, Syria in 2002. Currently, Osama is the head of mechanical design at Azizi Developments in Dubai, UAE"
  }
]